# Фрагмент А:
# исходный код
first=("2")
second=("3")
#print(first+second)
# ошибка: переменные имеют тип str, поэтому + выполняет склеивание, а не сложение
# преобразуем строки в целые числа через int
first_int=int(first)
second_int=int(second)
# ищем сумму
print(f"{first_int+second_int}")
# показываем типы значений до/после
print(f"Тип first до преобразования: {type(first)}")
print(f"Тип first после преобразования: {type(first_int)}")
print(f"Тип second до преобразования: {type(second)}")
print(f"Тип second после преобразования: {type(second_int)}")

# Фрагмент Б:
# исходный код
age=input("Возраст: ")
#print(age+1)
# ошибка: input всегда возвращает строку, даже если было введено число, поэтому age имеет тип str
# а age+1 пытается сложить строку и целое число, что вызывает ошибку
# преобразуем строку в целое число через int
age_int=int(age)
# ищем возраст через год
print(f"{age_int+1}")
# показываем тип значения до/после
print(f"Тип age до преобразования: {type(age)}")
print(f"Тип age после преобразования: {type(age_int)}")

# Фрагмент В:
# исходный код
first=4
second=7
third=10
#average=first+second+third/3
#print(average)
# ошибка: из-за преоритета операций деление выполняется раньше сложения, поэтому среднее значение не получается
# поставим скобки, чтобы указать порядок операции и сначала найти сумму, а затем разделить на 3
average=(first+second+third)/3
print(f"{average}")