# Запрашиваем значения
surname=str(input("Введите фамилию: "))
name=str(input("Введите имя: "))
group=str(input("Введите группу: "))
city=str(input("Введите город: "))
age=int(input("Введите возраст (от 1 до 120): "))
if age>120 and age<1:
    print("Ошибка. Некорректный возраст")
else:
    subject = str(input("Введите любимый предмет: "))
    time = float(input("Введите количество часов подготовки в неделю: "))
    if time<0:
        print("Ошибка. Некорректное количество часов")
    else:
        print('') # Выводим карточку студента и прописываем вычисления
        print("Карточка студента")
        print(f"Имя: {name}")
        print(f"Фамилия: {surname}")
        print(f"Группа: {group}")
        print(f"Город: {city}")
        print(f"Возраст: {age}")
        print(f"Любимый предмет: {subject}")
        print(f"Количество часов подготовки в неделю: {time}")
        print(f"Возраст через 4 года: {age+4}")
        print(f"Время подготовки за 4 недели: {time*4:.2f}")
        print(f"Среднее время подготовки в день за семидневную неделю: {time/7:.2f}")
