# Запрашиваем количество чисел
n=int(input("Введите целое количество чисел n (n>=1): "))
total=0  # прописываем накопитель суммы
count=0  # прописывпем счетчик положительных чисел
max_number=None  # чтобы максимум не остался 0 при max_number=0, прописываем None -  "значение пока отсутствует" и введенное число автоматически станет максимумом
# прописываем цикл для ввода чисел
for i in range(n):
    number=int(input(f"Введите число {i+1}: "))
    total+=number  # накопление суммы
    if number>0:
        count+=1 # подсчтитываем положительные числа
    if max_number is None or number>max_number:
        max_number=number # ищем максимум
# выводим результат
print(f"Сумма: {total}")
print(f"Количество положительных: {count}")
print(f"Максимум: {max_number}")
