# Запрашиваем количество чисел
n=int(input("Введите количество чисел n (n>=0): "))
count=0 # счетчик количества чисел, удовлетворяющих условию
total=0 # накопитель суммы этих чисел
# Прописываем цикл
for i in range(n):
    number=int(input(f"Введите число {i+1}: ")) # запрашиваем данные внутри цикла
    if abs(number)%10==2:  # проверяем условие
        count+=1 # подсчитывем количество
        total+=number # подсчитываем сумму
# Выводим результат
print(f"Количество значений: {count}")
print(f"Сумма значений: {total}")
